In [4]:
import pandas as pd

Read the csv file from this url:
'https://drive.google.com/file/d/1P2EyVCFAPeJcQ_lAN2W-bjwtbizOeFXE/view?usp=drive_link'

Name it `sets_df`

In [5]:
# your code here
url = 'https://drive.google.com/file/d/1P2EyVCFAPeJcQ_lAN2W-bjwtbizOeFXE/view?usp=drive_link'
path = 'https://drive.google.com/uc?export=download&id=' + url.split('/')[-2]
sets_df = pd.read_csv(path)

#### Exercise 1
Select and display only the `"name"` and `"year"` columns from `sets_df` using `.loc`

In [6]:
# your code here
sets_df.loc[:,['name', 'year']]

                                                  name  year
0                                         Wishing Well  2017
1    Advent Calendar 2011 Star Wars (Day  7) - Tool...  2011
2                                         Chief Wiggum  2014
3                                        Blaze Battler  1991
4                                 Dilophosaurus Ambush  2015
..                                                 ...   ...
995                      Basic Building Set Trial Size  1992
996                        Aquaman and Aqua Watercraft  2016
997                                      Mia's Bedroom  2012
998                              Inverted Slope Bricks  1987
999                                     Kingdoms Joust  2012

[1000 rows x 2 columns]

#### Exercise 2
Display the first 5 rows and first 3 columns of `sets_df` using `.iloc`

In [7]:
# your code here
sets_df.iloc[0:4, 0:3]

        set_num                                               name  year
0  TRUFRIENDS-1                                       Wishing Well  2017
1        7958-8  Advent Calendar 2011 Star Wars (Day  7) - Tool...  2011
2      71005-15                                       Chief Wiggum  2014
3        6593-1                                      Blaze Battler  1991

#### Exercise 3
Set the `set_num` column as an index using `.set_index()`. Make sure the change is done on the original DataFrame.

In [8]:
# your code here
sets_df = sets_df.set_index(sets_df['set_num'].values)

#### Exercise 4
Select the lego sets   
\['2250-2', '7324-21', '9509-15', '2824-8', '7324-12', '60024-11']

In [9]:
# your code here
sets_df.loc[['2250-2', '7324-21', '9509-15', '2824-8', '7324-12', '60024-11']]

,set_num,name,year,theme_id,num_parts
2250-2,2250-2,Advent Calendar 2000 (Day 1) Plane,2000,217,12
7324-21,7324-21,Advent Calendar 2005 City (Day 20) Skateboard ...,2005,220,4
9509-15,9509-15,"Advent Calendar 2012, Star Wars (Day 14) - Gen...",2012,225,10
2824-8,2824-8,Advent Calendar 2010 City (Day 7) Piano / Organ,2010,220,10
7324-12,7324-12,Advent Calendar 2005 City (Day 11) Barricade,2005,220,9
60024-11,60024-11,"Advent Calendar 2013, City (Day 10)",2013,220,8

#### Exercise 5
Building on Exercise 4, select only the columns `"num_parts"` and `"theme_id"` for these sets.

In [10]:
# your code here
sets_df.loc[['2250-2', '7324-21', '9509-15', '2824-8', '7324-12', '60024-11'], ['num_parts', 'theme_id']]

          num_parts  theme_id
2250-2           12       217
7324-21           4       220
9509-15          10       225
2824-8           10       220
7324-12           9       220
60024-11          8       220

#### Exercise 6
Reset the index so that `"num_set"` is just a regular column again.

In [11]:
# your code here
sets_df.reset_index()

,index,set_num,name,year,theme_id,num_parts
0,TRUFRIENDS-1,TRUFRIENDS-1,Wishing Well,2017,494,33
1,7958-8,7958-8,Advent Calendar 2011 Star Wars (Day 7) - Tool...,2011,225,9
2,71005-15,71005-15,Chief Wiggum,2014,550,6
3,6593-1,6593-1,Blaze Battler,1991,74,126
4,75916-1,75916-1,Dilophosaurus Ambush,2015,602,246
...,...,...,...,...,...,...
995,1668-1,1668-1,Basic Building Set Trial Size,1992,469,30
996,71237-1,71237-1,Aquaman and Aqua Watercraft,2016,604,43
997,3939-1,3939-1,Mia's Bedroom,2012,494,86
998,5161-1,5161-1,Inverted Slope Bricks,1987,443,16
999,10223-1,10223-1,Kingdoms Joust,2012,196,1574

#### Exercise 7
Now set `"year"` as the index and use `.loc` to select the year 1992. What happens?     
Reset the index after.

In [12]:
# your code here
sets_df = sets_df.set_index(sets_df['year'].values)
print(sets_df.loc[1992])
# there are duplicate indices
sets_df.reset_index()
print(sets_df)

     set_num                                         name  year  theme_id  \
1992  1896-1                                  Trauma Team  1992        78
1992   846-1                              Lighting Bricks  1992       473
1992  1895-1                                   Sky Patrol  1992        80
1992  9870-1  Pneumatic Rubber Bands and Pneumatic Tubing  1992         1
1992  5274-1      8 Tires / Tyres (4x24, 4x 30 mm) w/hubs  1992       453
1992  1769-1                                     Aircraft  1992       466
1992  6405-1                               Sunset Stables  1992        90
1992  9874-1                        Building Cards - 1090  1992       532
1992  5304-1                                    Wheelsets  1992       456
1992  1668-1                Basic Building Set Trial Size  1992       469

      num_parts
1992        296
1992         45
1992         89
1992        144
1992         16
1992         23
1992        132
1992          5
1992          2
1992         30
           set_num                                               name  year  \
2017  TRUFRIENDS-1                                       Wishing Well  2017
2011        7958-8  Advent Calendar 2011 Star Wars (Day  7) - Tool...  2011
2014      71005-15                                       Chief Wiggum  2014
1991        6593-1                                      Blaze Battler  1991
2015       75916-1                               Dilophosaurus Ambush  2015
...            ...                                                ...   ...
1992        1668-1                      Basic Building Set Trial Size  1992
2016       71237-1                        Aquaman and Aqua Watercraft  2016
2012        3939-1                                      Mia's Bedroom  2012
1987        5161-1                              Inverted Slope Bricks  1987
2012       10223-1                                     Kingdoms Joust  2012

      theme_id  num_parts
2017       494         33
2011       225          9
2014       550          6
1991        74        126
2015       602        246
...        ...        ...
1992       469         30
2016       604         43
2012       494         86
1987       443         16
2012       196       1574

[1000 rows x 5 columns]

#### Exercise 8
Use `set_index` to create a DataFrame with [two indexes](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html).

In [13]:
# your code here
#sets_df.info()
#sets_df.index = range(1000)
#sets_df

#### Exercise 9
Display the columns `set_num`, `theme_id` and `num_parts` of the last 15 rows by using `.iloc`

In [14]:
# your code here
set_num_index = sets_df.columns.get_loc('set_num')
theme_id_index = sets_df.columns.get_loc('theme_id')
num_parts_index = sets_df.columns.get_loc('num_parts')
sets_df.iloc[0:15, [set_num_index, theme_id_index, num_parts_index]]

           set_num  theme_id  num_parts
2017  TRUFRIENDS-1       494         33
2011        7958-8       225          9
2014      71005-15       550          6
1991        6593-1        74        126
2015       75916-1       602        246
2009        5642-1        56         23
1957        200A-1       372          1
1974         145-1       469        412
1990        6389-1        74        542
2009        8184-1       117        238
2003        5872-1       320         32
2012     5001273-1       432          3
2010       30051-1       163         61
2003       10077-1       256         55
2009        8961-1       439        479